; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_2 ?v8 - type_1 ?v6 - type_3)
 	      (pred_3 ?v4 - object ?v6 - type_3)
	      (pred_4 ?v8 - type_1 ?v3 - type_2)
	      (pred_1 ?v8 - type_1 ?v4 - object ?v3 - type_2))

   (:action op_1
       :parameters  (?v8 - type_1 ?v7 ?v5 - type_3)
       :precondition (and  (pred_2 ?v8 ?v7))
       :effect (and  (pred_2 ?v8 ?v5)
		     (not (pred_2 ?v8 ?v7))))

   (:action op_2
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_3 ?v1 ?v2) (pred_2 ?v8 ?v2) (pred_4 ?v8 ?v3))
       :effect (and (pred_1 ?v8 ?v1 ?v3)
		    (not (pred_3 ?v1 ?v2)) 
		    (not (pred_4 ?v8 ?v3))))

   (:action op_3
       :parameters (?v8 - type_1 ?v1 - object ?v2 - type_3 ?v3 - type_2)
       :precondition  (and  (pred_1 ?v8 ?v1 ?v3) (pred_2 ?v8 ?v2))
       :effect (and (pred_3 ?v1 ?v2)
		    (pred_4 ?v8 ?v3)
		    (not (pred_1 ?v8 ?v1 ?v3)))))

; problem
(define (problem gripper-1-4-3)
(:domain gripper-strips)
(:objects obj_04 - type_1
obj_01 obj_09 - type_2
obj_05 obj_10 obj_02 obj_06 - type_3
obj_03 obj_07 obj_08 - object)
(:init
(pred_2 obj_04 obj_10)
(pred_4 obj_04 obj_01)
(pred_4 obj_04 obj_09)
(pred_3 obj_03 obj_02)
(pred_3 obj_07 obj_02)
(pred_3 obj_08 obj_05)
)
(:goal
(and
(pred_3 obj_03 obj_02)
(pred_3 obj_07 obj_10)
(pred_3 obj_08 obj_05)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_1 obj_04 ?b obj_09))))
)
)

; plan
1. (op_1 obj_04 obj_10 obj_02)
   deleted: (pred_2 obj_04 obj_10)
   added: (pred_2 obj_04 obj_02)
   goals met: 2 of 3
2. (op_2 obj_04 obj_07 obj_02 obj_01)
   deleted: (pred_3 obj_07 obj_02) (pred_4 obj_04 obj_01)
   added: (pred_1 obj_04 obj_07 obj_01)
   goals met: 2 of 3
3. (op_1 obj_04 obj_02 obj_10)
   deleted: (pred_2 obj_04 obj_02)
   added: (pred_2 obj_04 obj_10)
   goals met: 2 of 3
4. (op_3 obj_04 obj_07 obj_10 obj_01)
   deleted: (pred_1 obj_04 obj_07 obj_01)
   added: (pred_3 obj_07 obj_10) (pred_4 obj_04 obj_01)
   goals met: 3 of 3
